// 5 exercise

/*
console.log("" + 1 + 0) կտա 10, որպես սթրինգ, քանի որ սթրինգին ցանկացած բան գումարելիս toString մեթոդի պես դարձնում է String
console.log(true + false) true`1 + false`0, հետևաբար 1 + 0 = 1
console.log("2" * "3") երկու սթրինգներ, որոնք պարունակում են թվեր բոլոր գործողությունների դեպքում(բացի +  ) կկատարի գործողությունը թվերի հետ, ու կվերադարձնի արժեքը՝6, որպես թիվ
console.log("$" + 4 + 5) քանի որ սթրինգին ենք գումարում, կտա $45 որպես սթրինգ
console.log("4px" - 2) սթրինգից հանած թիվ կտա NaN
console.log(null + 1) null`0 + 1, հետևաբար 0 + 1 = 1
console.log(undefined + 1) քանի որ գումարման ժամանակ նա փորձում է ամեն ինչ վերածել numberի , բայց undefinedը number դարձնելուց կտա Nan, հետևաբար undefined + 1 = NaN
console.log("apple" > "pineapple") 'p'>'a', ուրեմն կտա false
console.log("2" > "12")  կհամեմատի առաջին էլեմենտները և 2>1 ուրեմն կտա true
*/

